# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/versions'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'


# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

brew 'zsh'

# Install more recent versions of some OS X tools
brew 'grep'

# Install Binaries
brew 'python'
brew 'node'
brew 'git'
brew 'hub'
brew 'tree'
brew 'wget'

# Development
brew 'php-cs-fixer'
brew 'mysql'

# Install some common Apps
cask 'lastpass'
cask 'spotify'
cask 'spectacle'

#---Files & Storage---#
cask 'onedrive'
cask 'sourcetree'

#---Communication---#
cask 'slack'

#---Editors---#
cask 'phpstorm'
cask 'visual-studio-code'

#---DevTools---#
cask 'sequel-pro'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vagrant'
cask 'vagrant-manager'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
