# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/homebrew-php'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'


# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

brew 'zsh'

# Install more recent versions of some OS X tools
brew 'grep'

# Install Binaries
brew 'python'
brew 'node'
brew 'git'
brew 'hub'
brew 'tree'
brew 'wget'

# Development
brew 'homebrew/homebrew-php/php71-mcrypt'
brew 'homebrew/homebrew-php/php71-imagick'
brew 'homebrew/homebrew-php/php71-redis'
brew 'homebrew/homebrew-php/php71-intl'
brew 'php-cs-fixer'
brew 'mysql'

# Install some common Apps
cask 'lastpass'
cask 'spotify'
cask 'spectacle'
cask 'vlc'
cask 'deluge'

#---Files & Storage---#
cask 'dropbox'
cask 'google-drive'
cask 'onedrive'
cask 'filezilla'
cask 'sourcetree'

#---Browsers---#
cask 'google-chrome'

#---Communication---#
cask 'slack'
cask 'google-hangouts'

#---Editors---#
cask 'phpstorm'
cask 'sublime-text3'

#---DevTools---#
cask 'sequel-pro'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vagrant'
cask 'vagrant-manager'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'webpquicklook'
cask 'betterzipql'
cask 'qlimagesize'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'